#1.Create a table called employees with the following structure?
: emp_id (integer, should not be NULL and should be a primary key)Q
: emp_name (text, should not be NULL)
: age (integer, should have a check constraint to ensure the age is at least 18)
: email (text, should be unique for each employee)Q
: salary (decimal, with a default value of 30,000).
Write the SQL query to create the above table with all constraints.

CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY NOT NULL,
    emp_name TEXT NOT NULL,
    age INTEGER CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL DEFAULT 30000
);

In [ ]:
#1.Create a table called employees with the following structure?
#: emp_id (integer, should not be NULL and should be a primary key)
#: emp_name (text, should not be NULL)
#: age (integer, should have a check constraint to ensure the age is at least 18)
#: email (text, should be unique for each employee)Q
#: salary (decimal, with a default value of 30,000).
#Write the SQL query to create the above table with all constraints.

CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY NOT NULL,
    emp_name TEXT NOT NULL,
    age INTEGER CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL DEFAULT 30000
);

#2.Explain the purpose of constraints and how they help maintain data integrity in a database. Provide examples of common types of constraints.
Constraints in a database are rules applied to table columns to ensure the accuracy, reliability, and integrity of the data.
They enforce standards that prevent invalid, duplicate, or inconsistent entries, thereby helping maintain data quality and consistency across relationships.
Here are some common constraints:
PRIMARY KEY-Uniquely identifies each row in a table. Cannot be NULL
Eg:emp_id INTEGER PRIMARY KEY
NOT NULL-Ensures a column must have a value	Eg:emp_name TEXT NOT NULL
UNIQUE-Ensures all values in a column are different	Eg:email TEXT UNIQUE
CHECK-Ensures that values meet a specific condition	Eg:age INTEGER CHECK (age >= 18)
DEFAULT-Assigns a default value if none is provided	Eg:salary DECIMAL DEFAULT 30000
FOREIGN KEY-Ensures a value exists in another table’s column (enforces relationships)	Eg:dept_id INTEGER REFERENCES departments(dept_id)

#3.Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify your answer.
The NOT NULL constraint is applied to a column to ensure that a value must always be provided. It prevents missing or incomplete data by disallowing NULL values.
A primary key cannot contain NULL values.
A primary key uniquely identifies each row in a table.
NULL represents an unknown or missing value, and therefore:
Cannot guarantee uniqueness
Cannot be reliably used to identify a row.

#4.Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an example for both adding and removing a constraint.
To modify constraints on an existing table, you typically use the ALTER TABLE command in SQL. Constraints help enforce rules, but sometimes you may need to add new rules or remove outdated ones during schema evolution.
Add a Constraint:
ALTER TABLE table_name
ADD CONSTRAINT constraint_name constraint_type (column_name);
Remove a constraint:
ALTER TABLE table_name
DROP CONSTRAINT constraint_name;

#5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints.Provide an example of an error message that might occur when violating a constraint.
Attempting to insert, update, or delete data in a way that violates constraints will result in an error — the database rejects the operation to protect data integrity.
Constraints act like rules or contracts, and violating them typically throws an error with a clear explanation.
Common Consequences of Violating Constraints
PRIMARY KEY-Cannot insert duplicate or NULL key
NOT NULL-Cannot insert or update a column with a NULL value
UNIQUE-Cannot insert or update duplicate values
CHECK-Cannot insert or update data that fails the condition
FOREIGN KEY-Cannot insert a non-existing reference or delete referenced rows
Example of primary key violation:
INSERT INTO employees (emp_id, emp_name) VALUES (101, 'Alice');
Error Msg:
ERROR: duplicate key value violates primary key constraint "employees_pkey"
DETAIL: Key (emp_id)=(101) already exists.

#6.You created a products table without constraints as follows:
CREATE TABLE products (
    product_id INT,
    product_name VARCHAR(50),
    price DECIMAL(10, 2));
Now, you realise that?
: The product_id should be a primary keyQ
: The price should have a default value of 50.00
1.Add PRIMARY KEY on product_id
ALTER TABLE products
ADD CONSTRAINT pk_product_id
PRIMARY KEY (product_id);
2.Add a DEFAULT value for price
ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;
3.Verify
INSERT INTO products (product_id, product_name)
VALUES (1, 'Notebook');

#7.Write a query to fetch the student_name and class_name for each student using an INNER JOIN.
SELECT
    students.student_name,
    classes.class_name
FROM
    students
INNER JOIN
    classes ON students.class_id = classes.class_id;

#8.Write a query that shows all order_id, customer_name, and product_name, ensuring that all products are listed even if they are not associated with an order Hint: (use INNER JOIN and LEFT JOIN)
SELECT
    p.product_name,
    o.order_id,
    c.customer_name
FROM
    products p
LEFT JOIN
    orders o ON p.order_id = o.order_id
INNER JOIN
    customers c ON o.customer_id = c.customer_id;

#9.Write a query to find the total sales amount for each product using an INNER JOIN and the SUM() function.
SELECT
    p.product_name,
    SUM(s.amount) AS total_sales
FROM
    sales s
INNER JOIN
    products p ON s.product_id = p.product_id
GROUP BY
    p.product_name;

#10.Write a query to display the order_id, customer_name, and the quantity of products ordered by each customer using an INNER JOIN between all three tables.
SELECT
    o.order_id,
    c.customer_name,
    od.quantity
FROM
    orders o
INNER JOIN
    customers c ON o.customer_id = c.customer_id
INNER JOIN
    order_details od ON o.order_id = od.order_id;

**SQL** **Commands**

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving Mavenmovies.sql to Mavenmovies.sql

#1.Identify the primary keys and foreign keys in maven movies db. Discuss the differences.
Primary Keys (PK)
A Primary Key uniquely identifies each record in a table. It must be:
Unique
Not NULL
Some examples from Maven Movies:
Table	Primary Key Column(s)
actor	actor_id
address	address_id
category	category_id
city	city_id
country	country_id
customer	customer_id
film	film_id
inventory	inventory_id
language	language_id
payment	payment_id
rental	rental_id
staff	staff_id
store	store_id
film_actor	(actor_id, film_id) (composite)
film_category	(film_id, category_id) (composite)

Foreign Keys (FK)
A Foreign Key is a column (or set of columns) that links to the primary key in another table. It enforces referential integrity between related tables.
Some foreign key examples:
Table--ForeignKeyColumn--References
address	city_id	city(city_id)
city	country_id	country(country_id)
customer	address_id	address(address_id)
customer	store_id	store(store_id)
film	language_id	language(language_id)
film_actor	actor_id	actor(actor_id)
film_actor	film_id	film(film_id)
film_category	film_id	film(film_id)
film_category	category_id	category(category_id)
inventory	film_id	film(film_id)
inventory	store_id	store(store_id)
rental	inventory_id	inventory(inventory_id)
rental	customer_id	customer(customer_id)
rental	staff_id	staff(staff_id)
payment	customer_id	customer(customer_id)
payment	staff_id	staff(staff_id)
payment	rental_id	rental(rental_id)
store	manager_staff_id	staff(staff_id)
store	address_id	address(address_id)

#2.List all details of actors.
SELECT * FROM actor;

#3.List all customer information from DB.
SELECT * FROM customer;

#4.List different countries.
SELECT DISTINCT country
FROM country;

#5.Display all active customers.
SELECT *
FROM customer
WHERE active = TRUE;

#6.List of all rental IDs for customer with ID 1.
SELECT rental_id
FROM rental
WHERE customer_id = 1;

#7.Display all the films whose rental duration is greater than 5 .
SELECT *
FROM film
WHERE rental_duration > 5;

#8.List the total number of films whose replacement cost is greater than $15 and less than $20.
SELECT COUNT(*) AS total_films
FROM film
WHERE replacement_cost > 15 AND replacement_cost < 20;

#9.Display the count of unique first names of actors.
SELECT COUNT(DISTINCT first_name) AS unique_first_names FROM actor;

#10.Display the first 10 records from the customer table.
SELECT *
FROM customer
LIMIT 10;

#11. Display the first 3 records from the customer table whose first name starts with ‘b’.
SELECT *
FROM customer
WHERE first_name LIKE 'B%'
LIMIT 3;

#12.Display the names of the first 5 movies which are rated as ‘G’.
SELECT title
FROM film
WHERE rating = 'G'
LIMIT 5;

#13.Find all customers whose first name starts with "a".
SELECT *
FROM customer
WHERE first_name LIKE 'A%';

#14.Find all customers whose first name ends with "a".
SELECT *
FROM customer
WHERE first_name LIKE '%a';

#15. Display the list of first 4 cities which start and end with ‘a’ .
SELECT city
FROM city
WHERE city LIKE 'A%a'
LIMIT 4;

#16. Find all customers whose first name have "NI" in any position.
SELECT *
FROM customer
WHERE first_name LIKE '%NI%';

#17.Find all customers whose first name have "r" in the second position .
SELECT *
FROM customer
WHERE first_name LIKE '_r%';

#18.Find all customers whose first name starts with "a" and are at least 5 characters in length.
SELECT *
FROM customer
WHERE first_name LIKE 'A%' AND LENGTH(first_name) >= 5;

#19.Find all customers whose first name starts with "a" and ends with "o".
SELECT *
FROM customer
WHERE first_name LIKE 'A%o';

#20. Get the films with pg and pg-13 rating using IN operator.
SELECT *
FROM film
WHERE rating IN ('PG', 'PG-13');

#21. Get the films with length between 50 to 100 using between operator.
SELECT *
FROM film
WHERE length BETWEEN 50 AND 100;

#22.Get the top 50 actors using limit operator.
SELECT *
FROM actor
LIMIT 50;

#23.Get the distinct film ids from inventory table.
SELECT DISTINCT film_id
FROM inventory;

**FUNCTIONS**

#1.Retrieve the total number of rentals made in the Sakila database.
Hint: Use the COUNT() function.
SELECT COUNT(*) AS total_rentals
FROM rental;


#2.Find the average rental duration (in days) of movies rented from the Sakila database.
Hint: Utilize the AVG() function.
SELECT AVG(rental_duration) AS avg_rental_duration
FROM film;


#3.Display the first name and last name of customers in uppercase.
Hint: Use the UPPER () function.
SELECT
    UPPER(first_name) AS first_name_upper,
    UPPER(last_name) AS last_name_upper
FROM customer;


#4.Extract the month from the rental date and display it alongside the rental ID.
Hint: Employ the MONTH() function.
SELECT
    rental_id,
    MONTH(rental_date) AS rental_month
FROM rental;

**GROUP** **BY**
#5.Retrieve the count of rentals for each customer (display customer ID and the count of rentals).
Hint: Use COUNT () in conjunction with GROUP BY.
SELECT
    customer_id,
    COUNT(*) AS rental_count
FROM rental
GROUP BY customer_id;


#6.Find the total revenue generated by each store.
Hint: Combine SUM() and GROUP BY.
SELECT
    s.store_id,
    SUM(p.amount) AS total_revenue
FROM payment p
JOIN rental r ON p.rental_id = r.rental_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN store s ON i.store_id = s.store_id
GROUP BY s.store_id;


#7.Determine the total number of rentals for each category of movies.
Hint: JOIN film_category, film, and rental tables, then use cOUNT () and GROUPBY
SELECT
    c.name AS category,
    COUNT(r.rental_id) AS total_rentals
FROM category c
JOIN film_category fc ON c.category_id = fc.category_id
JOIN film f ON fc.film_id = f.film_id
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY c.name
ORDER BY total_rentals DESC;


#8.Find the average rental rate of movies in each language.
Hint: JOIN film and language tables, then use AVG () and GROUP BY.
SELECT
    l.name AS language,
    AVG(f.rental_rate) AS avg_rental_rate
FROM film f
JOIN language l ON f.language_id = l.language_id
GROUP BY l.name
ORDER BY avg_rental_rate DESC;

**JOINS**
#9.Display the title of the movie, customer s first name, and last name who rented it.
Hint: Use JOIN between the film, inventory, rental, and customer tables.
SELECT
    f.title AS movie_title,
    c.first_name AS customer_first_name,
    c.last_name AS customer_last_name
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN customer c ON r.customer_id = c.customer_id;


#10.Retrieve the names of all actors who have appeared in the film "Gone with the Wind."
Hint: Use JOIN between the film actor, film, and actor tables.
SELECT
    a.first_name,
    a.last_name
FROM film f
JOIN film_actor fa ON f.film_id = fa.film_id
JOIN actor a ON fa.actor_id = a.actor_id
WHERE f.title = 'Gone with the Wind';


#11.Retrieve the customer names along with the total amount they've spent on rentals.
Hint: JOIN customer, payment, and rental tables, then use SUM() and GROUP BY.
SELECT
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_amount_spent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name
ORDER BY total_amount_spent DESC;


#12.List the titles of movies rented by each customer in a particular city (e.g., 'London').
Hint: JOIN customer, address, city, rental, inventory, and film tables, then use GROUP BY.
SELECT
    c.first_name,
    c.last_name,
    ci.city,
    f.title AS rented_movie
FROM customer c
JOIN address a ON c.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
WHERE ci.city = 'London'
ORDER BY c.last_name, f.title;

**Advanced Joins and GROUP BY:**
#13.Display the top 5 rented movies along with the number of times they've been rented.
Hint: JOIN film, inventory, and rental tables, then use COUNT () and GROUP BY, and limit the results.
SELECT
    f.title AS movie_title,
    COUNT(r.rental_id) AS times_rented
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY f.film_id, f.title
ORDER BY times_rented DESC
LIMIT 5;


#14.Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).
Hint: Use JOINS with rental, inventory, and customer tables and consider COUNT() and GROUP BY.
SELECT
    r.customer_id,
    c.first_name,
    c.last_name,
    COUNT(DISTINCT i.store_id) AS store_count
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN customer c ON r.customer_id = c.customer_id
GROUP BY r.customer_id, c.first_name, c.last_name
HAVING COUNT(DISTINCT i.store_id) = 2;

**Windows Function:**
#1.Rank the customers based on the total amount they've spent on rentals.
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_spent,
    RANK() OVER (ORDER BY SUM(p.amount) DESC) AS spending_rank
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name
ORDER BY total_spent DESC;


#2. Calculate the cumulative revenue generated by each film over time.
SELECT
    f.title AS film_title,
    p.payment_date,
    SUM(p.amount) AS daily_revenue,
    SUM(p.amount) OVER (
        PARTITION BY f.film_id
        ORDER BY p.payment_date
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ) AS cumulative_revenue
FROM payment p
JOIN rental r ON p.rental_id = r.rental_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
ORDER BY f.title, p.payment_date;


#3.Determine the average rental duration for each film, considering films with similar lengths.
SELECT
    length AS film_length,
    AVG(rental_duration) AS avg_rental_duration
FROM film
GROUP BY length
ORDER BY film_length;


#4.Identify the top 3 films in each category based on their rental counts.
SELECT
    c.name AS category_name,
    f.title AS film_title,
    COUNT(r.rental_id) AS rental_count,
    RANK() OVER (
        PARTITION BY c.category_id
        ORDER BY COUNT(r.rental_id) DESC
    ) AS rank_within_category
FROM category c
JOIN film_category fc ON c.category_id = fc.category_id
JOIN film f ON fc.film_id = f.film_id
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY c.category_id, c.name, f.film_id, f.title
QUALIFY RANK() OVER (
    PARTITION BY c.category_id
    ORDER BY COUNT(r.rental_id) DESC
) <= 3
ORDER BY c.name, rank_within_category;


#5.Calculate the difference in rental counts between each customer's total rentals and the average rentals across all customers.
WITH customer_rental_counts AS (
    SELECT
        customer_id,
        COUNT(*) AS total_rentals
    FROM rental
    GROUP BY customer_id
),
average_rentals AS (
    SELECT AVG(total_rentals) AS avg_rentals
    FROM customer_rental_counts
)
SELECT
    crc.customer_id,
    crc.total_rentals,
    ar.avg_rentals,
    crc.total_rentals - ar.avg_rentals AS rental_difference
FROM customer_rental_counts crc
CROSS JOIN average_rentals ar
ORDER BY rental_difference DESC;


#6.Find the monthly revenue trend for the entire rental store over time.
SELECT
    YEAR(payment_date) AS year,
    MONTH(payment_date) AS month,
    SUM(amount) AS monthly_revenue
FROM payment
GROUP BY YEAR(payment_date), MONTH(payment_date)
ORDER BY year, month;


#7. Identify the customers whose total spending on rentals falls within the top 20% of all customers.
WITH customer_spending AS (
    SELECT
        customer_id,
        SUM(amount) AS total_spent
    FROM payment
    GROUP BY customer_id
),
ranked_customers AS (
    SELECT
        customer_id,
        total_spent,
        PERCENT_RANK() OVER (ORDER BY total_spent DESC) AS spending_percentile
    FROM customer_spending
)
SELECT *
FROM ranked_customers
WHERE spending_percentile <= 0.20
ORDER BY total_spent DESC;


#8.Calculate the running total of rentals per category, ordered by rental count.
WITH category_rental_counts AS (
    SELECT
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM category c
    JOIN film_category fc ON c.category_id = fc.category_id
    JOIN film f ON fc.film_id = f.film_id
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY c.category_id, c.name
)
SELECT
    category_name,
    rental_count,
    SUM(rental_count) OVER (
        ORDER BY rental_count DESC
    ) AS running_total_rentals
FROM category_rental_counts
ORDER BY rental_count DESC;


#9.Find the films that have been rented less than the average rental count for their respective categories.
-- Step 1: Rental count per film and category
WITH film_rentals AS (
    SELECT
        f.film_id,
        f.title,
        c.category_id,
        c.name AS category_name,
        COUNT(r.rental_id) AS film_rental_count
    FROM film f
    JOIN film_category fc ON f.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY f.film_id, f.title, c.category_id, c.name
),

-- Step 2: Average rental count per category
category_avg AS (
    SELECT
        category_id,
        AVG(film_rental_count) AS avg_rental_count
    FROM film_rentals
    GROUP BY category_id
)

-- Step 3: Compare film rentals to category average
SELECT
    fr.title,
    fr.category_name,
    fr.film_rental_count,
    ca.avg_rental_count
FROM film_rentals fr
JOIN category_avg ca ON fr.category_id = ca.category_id
WHERE fr.film_rental_count < ca.avg_rental_count
ORDER BY fr.category_name, fr.film_rental_count;


#10. Identify the top 5 months with the highest revenue and display the revenue generated in each month.
SELECT
    TO_CHAR(payment_date, 'YYYY-MM') AS month,
    SUM(amount) AS monthly_revenue
FROM payment
GROUP BY TO_CHAR(payment_date, 'YYYY-MM')
ORDER BY monthly_revenue DESC
LIMIT 5;

**Normalisation & CTE**
#1. First Normal Form (1NF):
a. Identify a table in the Sakila database that violates 1NF. Explain how you would normalize it .
A relation is in First Normal Form (1NF) if:
All attributes (columns) contain only atomic (indivisible) values.
Each field contains only one value – no repeating groups or arrays in a single column.
the actor_award table violates First Normal Form (1NF) because:
The values are not atomic
It represents a multi-valued attribute
How to Normalize the Table to Achieve 1NF:
Step 1: Create a new award table
CREATE TABLE award (
  award_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  award_name VARCHAR(45) NOT NULL,
  PRIMARY KEY (award_id)
);
Step 2: Create a new many-to-many relationship table: actor_award_mapping
CREATE TABLE actor_award_mapping (
  actor_id SMALLINT UNSIGNED NOT NULL,
  award_id SMALLINT UNSIGNED NOT NULL,
  PRIMARY KEY (actor_id, award_id),
  FOREIGN KEY (actor_id) REFERENCES actor(actor_id),
  FOREIGN KEY (award_id) REFERENCES award(award_id)
);
Step 3: Remove the non-atomic awards column from actor_award, or eliminate the table entirely if redundant.

#2.Second Normal Form (2NF):
a. Choose a table in Sakila and describe how you would determine whether it is in 2NF. If it violates 2NF, explain the steps to normalize it.
A table is in 2NF if:
It is already in First Normal Form (1NF).
All non-prime attributes are fully functionally dependent on the whole primary key, not just part of it.
This means no partial dependency: no non-key column should depend on part of a composite primary key.
film_actor violates 2NF.
CREATE TABLE film_actor (
  actor_id SMALLINT UNSIGNED NOT NULL,
  film_id SMALLINT UNSIGNED NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (actor_id, film_id)
);
Composite primary key: (actor_id, film_id)
Non-prime attribute: last_update
Violation:
last_update is not dependent on the full composite key (actor_id, film_id). It's only about when the row was last modified — not dependent on both IDs.
Hence, film_actor violates 2NF due to partial dependency.
How to Normalize it to 2NF:
Step 1: Split the table
Create a relationship table with only the composite key:
CREATE TABLE film_actor_mapping (
  actor_id SMALLINT UNSIGNED NOT NULL,
  film_id SMALLINT UNSIGNED NOT NULL,
  PRIMARY KEY (actor_id, film_id),
  FOREIGN KEY (actor_id) REFERENCES actor(actor_id),
  FOREIGN KEY (film_id) REFERENCES film(film_id)
);
Step 2: Move last_update to a new table if it's actor- or film-specific:
If last_update refers to when an actor last worked on a film, you might retain it with the composite key only if it depends on both.
Otherwise, move it to a relevant table:
If it's just about the actor: move to actor table.
If it's about the film: move to film.

#3.Third Normal Form (3NF):
a.Identify a table in Sakila that violates 3NF. Describe the transitive dependencies present and outline the steps to normalize the table to 3NF.
A table is in 3NF if:
It is in Second Normal Form (2NF).
It has no transitive dependencies, i.e., non-prime attributes must depend only on the primary key, and not on other non-prime attributes.
Table That Violates 3NF: customer_list (a View)
Even though customer_list is a view, not a base table, it combines data in a way that introduces transitive dependencies, making it a useful example.
Here’s the structure of the view:
CREATE VIEW customer_list AS
SELECT
  cu.customer_id AS ID,
  CONCAT(cu.first_name, ' ', cu.last_name) AS name,
  a.address AS address,
  a.postal_code AS `zip code`,
  a.phone AS phone,
  city.city AS city,
  country.country AS country,
  IF(cu.active, 'active','') AS notes,
  cu.store_id AS SID
FROM customer cu
JOIN address a ON cu.address_id = a.address_id
JOIN city ON a.city_id = city.city_id
JOIN country ON city.country_id = country.country_id;
How to Normalize the Table to 3NF:
To break these transitive dependencies:
Step 1: Keep customer data in one table:
CREATE TABLE customer_clean (
  customer_id SMALLINT PRIMARY KEY,
  store_id TINYINT,
  first_name VARCHAR(45),
  last_name VARCHAR(45),
  email VARCHAR(50),
  address_id SMALLINT,
  active BOOLEAN,
  create_date DATETIME
  -- exclude derived/transitive data
);
Step 2: Store address info separately (already exists in Sakila):
CREATE TABLE address (
  address_id SMALLINT PRIMARY KEY,
  address VARCHAR(50),
  postal_code VARCHAR(10),
  phone VARCHAR(20),
  city_id SMALLINT
);
Step 3: Store city and country independently:
CREATE TABLE city (
  city_id SMALLINT PRIMARY KEY,
  city VARCHAR(50),
  country_id SMALLINT
);

CREATE TABLE country (
  country_id SMALLINT PRIMARY KEY,
  country VARCHAR(50)
);

#4.Normalization Process:
a.Take a specific table in Sakila and guide through the process of normalizing it from the initial unnormalized form up to atleast 2NF.
Target Table:actor_award
This table is ideal because it has common normalization issues such as:
Multi-valued fields (violating 1NF)
Partial and transitive dependencies (violating 2NF and 3NF)
Unnormalized Form (UNF)
Suppose we start with this unnormalized table:
| actor_award_id | actor_name         | awards                   |
|----------------|--------------------|---------------------------|
| 1              | Karl Berry         | Emmy, Oscar, Tony         |
| 2              | Kirsten Paltrow    | Oscar                     |
| 3              | Gary Phoenix       | Emmy, Tony                |
Problems:
Multi-valued field: awards contains multiple values (comma-separated).
No atomicity.
No separation between actor_name and its components.
Step 1: First Normal Form (1NF)
Goal:
Ensure all fields are atomic.
Eliminate repeating groups or multi-valued columns.
Transformation:
Split multi-valued awards into separate rows and split actor name:
| actor_award_id | actor_first_name | actor_last_name | award   |
|----------------|------------------|------------------|---------|
| 1              | Karl             | Berry            | Emmy    |
| 1              | Karl             | Berry            | Oscar   |
| 1              | Karl             | Berry            | Tony    |
| 2              | Kirsten          | Paltrow          | Oscar   |
| 3              | Gary             | Phoenix          | Emmy    |
| 3              | Gary             | Phoenix          | Tony    |
Still not normalized fully — we have data duplication for names and award titles.
Step 2: Second Normal Form (2NF)
Goal:
Eliminate partial dependencies (non-key attributes must depend on the whole primary key).
Requires the table to already be in 1NF.
Issue:
In a composite key like (actor_first_name, actor_last_name, award), attributes like actor_first_name and actor_last_name don't depend on the full key.
Solution:
Break into two tables:
Table 1:actor
| actor_id | first_name | last_name |
|----------|------------|-----------|
| 1        | Karl       | Berry     |
| 2        | Kirsten    | Paltrow   |
| 3        | Gary       | Phoenix   |
Table 2:award
| award_id | award_name |
|----------|------------|
| 1        | Emmy       |
| 2        | Oscar      |
| 3        | Tony       |
Table 3: actor_award_mapping (Bridge Table)
| actor_id | award_id |
|----------|----------|
| 1        | 1        |
| 1        | 2        |
| 1        | 3        |
| 2        | 2        |
| 3        | 1        |
| 3        | 3        |
Step 3: Third Normal Form (3NF)
Goal:
Remove transitive dependencies (non-key → non-key dependencies).
Result:
We already split:
Actor names from the mapping,
Award names into a separate table.
All non-key attributes in each table depend only on the primary key of their respective tables, and not on other non-key attributes.
Hence, the structure is now in 3NF.
Final Normalized Structure:
actor
CREATE TABLE actor (
  actor_id SMALLINT PRIMARY KEY AUTO_INCREMENT,
  first_name VARCHAR(45),
  last_name VARCHAR(45)
);
award
CREATE TABLE award (
  award_id SMALLINT PRIMARY KEY AUTO_INCREMENT,
  award_name VARCHAR(45)
);
actor_award_mapping
CREATE TABLE actor_award_mapping (
  actor_id SMALLINT,
  award_id SMALLINT,
  PRIMARY KEY (actor_id, award_id),
  FOREIGN KEY (actor_id) REFERENCES actor(actor_id),
  FOREIGN KEY (award_id) REFERENCES award(award_id)
);

#5.CTE Basics:
a. Write a query using a CTE to retrieve the distinct list of actor names and the number of films they have acted in from the actor and film_actor tables.
CTE (Common Table Expression) query that retrieves the distinct list of actor names along with the number of films they have acted in from the actor and film_actor tables in the Sakila (MavenMovies) database
WITH actor_film_count AS (
    SELECT
        fa.actor_id,
        COUNT(fa.film_id) AS film_count
    FROM film_actor fa
    GROUP BY fa.actor_id
)
SELECT
    a.actor_id,
    CONCAT(a.first_name, ' ', a.last_name) AS actor_name,
    afc.film_count
FROM actor a
JOIN actor_film_count afc ON a.actor_id = afc.actor_id
ORDER BY afc.film_count DESC;

actor_film_count: This CTE calculates the number of films per actor from the film_actor table.
The main query joins the actor table with the CTE to get the actor name and the film count.
CONCAT(first_name, ' ', last_name) gives the full name.
ORDER BY afc.film_count DESC lists actors starting from the one with the most films.

#6.CTE with Joins:
a.Create a CTE that combines information from the film and language tables to display the film title, language name, and rental rate.
WITH film_language_cte AS (
    SELECT
        f.film_id,
        f.title,
        f.rental_rate,
        l.name AS language_name
    FROM film f
    JOIN language l ON f.language_id = l.language_id
)

SELECT
    film_id,
    title,
    language_name,
    rental_rate
FROM film_language_cte
ORDER BY title;
CTE Name: film_language_cte

Join: Matches film.language_id with language.language_id

Selected Fields: film.title, language.name (as language_name), and film.rental_rate

Final SELECT: Reads from the CTE and orders by title for readability.

#7.CTE for Aggregation:
a.Write a query using a CTE to find the total revenue generated by each customer (sum of payments) from the customer and payment table.
SQL Query Using CTE for Aggregation:
WITH customer_revenue AS (
    SELECT
        p.customer_id,
        SUM(p.amount) AS total_revenue
    FROM payment p
    GROUP BY p.customer_id
)

SELECT
    c.customer_id,
    CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
    cr.total_revenue
FROM customer c
JOIN customer_revenue cr ON c.customer_id = cr.customer_id
ORDER BY cr.total_revenue DESC;
Explanation:
CTE Name: customer_revenue
CTE Role: Aggregates total payment (SUM(amount)) per customer_id
Main Query: Joins the CTE with the customer table to display:
customer_id
Full name (first_name + last_name)
total_revenue
Ordered by highest revenue customers first.

#8.CTE with Window Functions:
a.Utilize a CTE with a window function to rank films based on their rental duration from the film table.
a SQL query that uses a CTE (Common Table Expression) along with a window function (RANK()) to rank films by their rental duration from the film table.
WITH film_ranks AS (
    SELECT
        film_id,
        title,
        rental_duration,
        RANK() OVER (ORDER BY rental_duration DESC) AS rental_rank
    FROM film
)
SELECT
    film_id,
    title,
    rental_duration,
    rental_rank
FROM film_ranks
ORDER BY rental_rank, title;
Explanation:
CTE Name: film_ranks
Window Function: RANK() OVER (ORDER BY rental_duration DESC) assigns a rank to each film, with longer rental durations getting a higher rank (i.e., lower number).
Final SELECT: Lists films with their rank and sorts them by rank and title for clarity.

#9.CTE and Filtering:
a.Create a CTE to list customers who have made more than two rentals, and then join this CTE with the customer table  to retrieve additional customer details.
SQL query that uses a CTE (Common Table Expression) to:
Identify customers who have made more than two rentals from the rental table.
Join this result with the customer table to get full customer details.
WITH frequent_customers AS (
    SELECT
        customer_id,
        COUNT(rental_id) AS rental_count
    FROM rental
    GROUP BY customer_id
    HAVING COUNT(rental_id) > 2
)
SELECT
    c.customer_id,
    CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
    c.email,
    c.store_id,
    fc.rental_count
FROM customer c
JOIN frequent_customers fc ON c.customer_id = fc.customer_id
ORDER BY fc.rental_count DESC;
Explanation:
CTE Name: frequent_customers
Aggregates number of rentals per customer.
Filters to only include those with more than 2 rentals.
Main Query:
Joins frequent_customers with customer to retrieve:
customer_id, full name, email, store ID, and rental count.
Ordering by rental count in descending order to see the most active customers first.

#10.CTE for Date Calculations:
a.Write a query using a CTE to find the total number of rentals made each month, considering the rental_date from the rental table.
a SQL query using a CTE (Common Table Expression) to calculate the total number of rentals made each month based on the rental_date column in the rental table.
WITH monthly_rentals AS (
    SELECT
        DATE_FORMAT(rental_date, '%Y-%m') AS rental_month,
        COUNT(*) AS total_rentals
    FROM rental
    GROUP BY DATE_FORMAT(rental_date, '%Y-%m')
)
SELECT
    rental_month,
    total_rentals
FROM monthly_rentals
ORDER BY rental_month;
Explanation:
CTE Name: monthly_rentals
DATE_FORMAT(rental_date, '%Y-%m') extracts the year and month from the rental date.
COUNT(*) counts the number of rentals per month.
The outer query simply retrieves and displays the monthly summary.

#11.CTE and Self-Join:
a.Create a CTE to generate a report showing pairs of actors who have appeared in the same film together, using the film_actor table.
To generate a report of actor pairs who have appeared in the same film together, you can use a CTE with a self-join on the film_actor table.
SQL Query Using CTE and Self-Join:
WITH film_actor_pairs AS (
    SELECT
        fa1.film_id,
        fa1.actor_id AS actor1_id,
        fa2.actor_id AS actor2_id
    FROM film_actor fa1
    JOIN film_actor fa2
        ON fa1.film_id = fa2.film_id
       AND fa1.actor_id < fa2.actor_id  -- avoid duplicates and self-pairs
)
SELECT
    fap.film_id,
    CONCAT(a1.first_name, ' ', a1.last_name) AS actor_1,
    CONCAT(a2.first_name, ' ', a2.last_name) AS actor_2
FROM film_actor_pairs fap
JOIN actor a1 ON fap.actor1_id = a1.actor_id
JOIN actor a2 ON fap.actor2_id = a2.actor_id
ORDER BY fap.film_id, actor_1, actor_2;
Explanation:
CTE Name: film_actor_pairs
Performs a self-join on film_actor for each film.
Uses fa1.actor_id < fa2.actor_id to:
Avoid duplicate pairs (A,B and B,A),
Exclude self-pairs (A,A).
Main Query: Joins with the actor table to get readable actor names.

#12.CTE for Recursive Search:
a.Implement a recursive CTE to find all employees in the staff table who report to a specific manager, considering the reports_to column.
To implement a recursive CTE that finds all employees who report to a specific manager, directly or indirectly, based on a reports_to column in the staff table, we follow these steps:
-- Replace :manager_id with the actual manager's staff_id (e.g., 1)
WITH RECURSIVE staff_hierarchy AS (
    -- Anchor member: direct reports to the given manager
    SELECT
        staff_id,
        first_name,
        last_name,
        reports_to
    FROM staff
    WHERE reports_to = :manager_id

    UNION ALL

    -- Recursive member: find employees who report to staff found in the previous step
    SELECT
        s.staff_id,
        s.first_name,
        s.last_name,
        s.reports_to
    FROM staff s
    INNER JOIN staff_hierarchy sh ON s.reports_to = sh.staff_id
)

SELECT
    staff_id,
    CONCAT(first_name, ' ', last_name) AS employee_name,
    reports_to
FROM staff_hierarchy;
Explanation:
Anchor Query: Selects employees who directly report to the specified manager.
Recursive Query: Iteratively finds staff who report to those staff, forming a hierarchy.
The recursion continues until no more indirect reports are found.
Example:
If manager with staff_id = 1 has:
Employee A reporting to them,
Employee B reporting to A,
Employee C reporting to B,
Then the query will return A, B, and C.